tap "homebrew/bundle"
tap "laishulu/homebrew"

brew "awscli"
brew "codex"
brew "direnv"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "jq"
brew "lazygit"
brew "macism"
brew "micro"
brew "mise"
brew "neovim"
brew "node"
brew "peco"
brew "sheldon"
brew "starship"
brew "watch"

cask "1password"
cask "1password-cli"
cask "alfred"
cask "deepl"
cask "gitify"
cask "obsidian"
cask "orbstack"
cask "raycast"
cask "slack"
cask "zoom"
cask "cursor"
cask "wezterm"
cask "font-plemol-jp-nf"

# cask "discord"
# cask "google-japanese-ime"

vscode "anthropic.claude-code"
vscode "bierner.markdown-mermaid"
vscode "biomejs.biome"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "jackiotyu.git-worktree-manager"
vscode "ms-playwright.playwright"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.test-adapter-converter"
vscode "openai.chatgpt"
vscode "qezhu.gitlink"
vscode "seatonjiang.gitmoji-vscode"
vscode "yzane.markdown-pdf"
