tap "laishulu/homebrew"
tap "manaflow-ai/cmux"
tap "oven-sh/bun"

brew "agent-browser"
brew "awscli"
brew "bat"
brew "btop"
brew "bun"
brew "direnv"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "git-delta"  # lazygit / git diff のシンタックスハイライト
brew "jq"
brew "lazygit"
brew "lefthook"
brew "lychee"
brew "macism"
brew "micro"
brew "mise"
brew "neovim"
brew "tree-sitter-cli"  # nvim-treesitter main ブランチのパーサビルドに必須
brew "uv"
cask "ngrok"
brew "node"
brew "sheldon"
brew "starship"
brew "tmux"
brew "watch"

cask "1password"
cask "1password-cli"
cask "alfred"
cask "deepl"
cask "gitify"
cask "obsidian"
cask "orbstack"
cask "raycast"
cask "slack"
cask "shottr"
cask "claude-code@latest"
cask "cmux"
cask "cursor"
cask "ghostty"
cask "wezterm"
cask "font-plemol-jp-nf"
cask "keycastr"

# cask "discord"
# cask "google-japanese-ime"

vscode "anthropic.claude-code"
vscode "asvetliakov.vscode-neovim"
vscode "bierner.markdown-mermaid"
vscode "biomejs.biome"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "jackiotyu.git-worktree-manager"
vscode "ms-playwright.playwright"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.test-adapter-converter"
vscode "openai.chatgpt"
vscode "qezhu.gitlink"
vscode "seatonjiang.gitmoji-vscode"
vscode "yzane.markdown-pdf"
